const categories = [
  {
    name: "Історія",
    questions: [
      {
        text: "Хто був першим президентом України?",
        answers: ["Кравчук", "Ющенко", "Кучма", "Янукович"],
        correct: 0
      },
      // 🔁 ще 49 питань
    ]
  },
  {
    name: "Математика",
    questions: [
      {
        text: "Скільки буде 7 × 8?",
        answers: ["54", "56", "64", "48"],
        correct: 1
      },
       {
        text: "Скільки буде 4 × 4?",
        answers: ["16", "56", "64", "48"],
        correct: 0
      },
      {
        text: "Скільки буде 5 × 5?",
        answers: ["16", "56", "64", "25"],
        correct: 4
      },
      {
        text: "Скільки буде 2 × 2?",
        answers: ["16", "56", "4", "20"],
        correct: 2
      },
      // 🔁 ще 49 питань
    ]
  },

  // 👉 додай ще 13 категорій
];
